<template>
    <h4>{{ title }}</h4>
    <div class="v-ttest">
        <input type="text" v-model="banks.filterWord" @keyup="banks.createFilteredDebounced">
    </div>
<!--    <span>banks.filterWordDebounced: {{banks.filterWordDebounced}}</span>-->
    <br>
    <span>banks.filteredBanks: {{JSON.stringify(banks.filtered)}}</span>
    <div class="v-ttest">
        <input type="text" v-model="xxx">
    </div>

</template>

<script>
    export default {
        name: "v-ttest",
        components: {},
        props: ['title'],
        data() {
            return {
                xxx: '',
                banks: {
                    all: ["АБ РОССИЯ", "Абсолют Банк", "Авангард", "Автоградбанк", "Автоторгбанк", "АГРОПРОМКРЕДИТ", "Азиатско-Тихоокеанский Банк", "Ак Барс Банк", "АКБ Держава", "АКБ ЕВРОФИНАНС МОСНАРБАНК", "АКБ Приморье", "АКБ СЛАВИЯ", "АКБ Тендер Банк", "АКБ ЦентроКредит", "АКИБАНК", "Алеф-Банк", "Алмазэргиэнбанк", "Альфа-Банк", "Аресбанк", "БАЛТИНВЕСТБАНК", "Банк Аверс", "Банк Агророс", "Банк Акцепт", "Банк Александровский", "Банк БКФ", "Банк ВБРР", "Банк Венец", "Банк ДОМ.РФ", "Банк Екатеринбург", "Банк Заречье", "Банк Зенит", "Банк Интеза", "Банк ИПБ", "Банк ИТУРУП", "Банк Йошкар-Ола", "Банк Казани", "Банк Кремлевский", "Банк МБА-МОСКВА", "БАНК МОСКВА-СИТИ", "Банк Объединенный капитал", "БАНК ОРЕНБУРГ", "Банк ПСКБ", "Банк Развитие-Столица", "Банк Раунд", "Банк Русский Стандарт", "Банк Саратов", "БАНК СГБ", "Банк СКС", "Банк Снежинский", "Банк СОЮЗ", "БАНК УРАЛСИБ", "Банк Финсервис", "ББР Банк", "Белгородсоцбанк", "БКС Банк", "Бланк банк", "Братский АНКБ", "БыстроБанк", "ВЛАДБИЗНЕСБАНК", "ВНЕШФИНБАНК", "ВТБ", "ВУЗ банк", "Газпромбанк", "Газэнергобанк", "Гарант-Инвест банк", "ГЕНБАНК", "ГОРБАНК", "ГТ банк", "ГУТА-БАНК", "Дальневосточный банк", "Датабанк", "Джей энд Ти Банк", "Единая Расчетная Палата", "Енисейский Объединенный банк", "Запсибкомбанк", "Земский банк", "Золотая Корона (РНКО Платежный центр)", "ИК Банк", "Инбанк", "ИНГ БАНК (ЕВРАЗИЯ)", "ИШБАНК", "КБ АКРОПОЛЬ", "КБ Байкалкредобанк", "КБ Восточный", "КБ ИС Банк", "КБ КОЛЬЦО УРАЛА", "КБ Новый Век", "КБ Пойдем!", "КБ РостФинанс", "КБ СОЛИДАРНОСТЬ", "КБ Стройлесбанк", "КБ Хлынов", "КБ ЮНИСТРИМ", "КВАНТ МОБАЙЛ БАНК (Плюс Банк)", "КИВИ Банк", "КОШЕЛЕВ-БАНК", "Кредит Европа Банк (Россия)", "Кредит Урал Банк", "Крокус-Банк", "КС БАНК", "Кубань Кредит", "Кубаньторгбанк", "Кузнецкбизнесбанк", "Ланта-Банк", "Левобережный", "ЛОКО-Банк", "МБ Банк", "МЕЖДУНАРОДНЫЙ ФИНАНСОВЫЙ КЛУБ", "Металлинвестбанк", "МЕТКОМБАНК", "МИнБанк", "МКБ", "Модульбанк", "МОНЕТА", "МОРСКОЙ БАНК", "МОСКОМБАНК", "Москоммерцбанк", "МОСОБЛБАНК", "МС Банк Рус", "МСП Банк", "МТС-Банк", "Нацинвестпромбанк", "Национальный стандарт", "НБД-Банк", "НИКО-БАНК", "НК Банк", "НКО МОБИ.Деньги", "НКО ЮМани", "НОВИКОМБАНК", "Новобанк", "НОКССБАНК", "Норвик Банк", "НРБанк", "НС Банк", "Открытие", "ОТП Банк", "Первый Инвестиционный Банк", "Платина", "Почта Банк", "Примсоцбанк", "Прио-Внешторгбанк", "ПроБанк", "Промсвязьбанк", "ПромТрансБанк", "Райффайзенбанк", "Реалист Банк", "Ренессанс Кредит", "РЕСО Кредит", "РНКБ Банк", "РНКО Деньги.Мэйл.Ру", "Росбанк", "Росгосстрах Банк", "РосДорБанк", "Россельхозбанк", "РУСНАРБАНК", "Русьуниверсалбанк", "Санкт-Петербург", "САРОВБИЗНЕСБАНК", "Сбербанк", "СДМ-Банк", "Северный Народный Банк", "Сетелем Банк", "Сибсоцбанк", "СИНКО-БАНК", "Ситибанк", "СКБ-банк", "СМП Банк", "СНГБ", "Совкомбанк", "Солид Банк", "СОЦИУМ-БАНК", "Таврический Банк", "ТАТСОЦБАНК", "Тимер Банк", "Тинькофф", "Тойота Банк", "Тольяттихимбанк", "Томскпромстройбанк", "Точка \"ФК Открытие\"", "Транскапиталбанк", "Трансстройбанк", "УБРиР", "Углеметбанк", "Урал ФД", "УРАЛПРОМБАНК", "Филиал Возрождение БМ Банк", "ФИНАМ", "ФОРА-БАНК", "Форштадт", "Хакасский муниципальный банк", "ХКФ Банк", "Центр-инвест", "Чайна Констракшн Банк", "ЧЕЛИНДБАНК", "ЧЕЛЯБИНВЕСТБАНК", "Экономбанк", "Экспобанк", "Элплат", "Энергобанк", "Энерготрансбанк", "Эс-Би-Ай Банк", "ЮГ-Инвестбанк", "Юникредит Банк", "WebMoney (Банк ККБ)"],
                    filtered: [],
                    filterWord: '',
                    timeout: 2000,
                    timer: undefined,
                    createFilteredDebounced: function() {
                        console.log(`in debounced`);
                        clearTimeout(this.timer);
                        this.timer = setTimeout(this.func, this.timeout);
                    },
                    func: ()=> {
                        console.log(`in func`);
                        if (this.banks.filterWord.length > 1) { // начинаем поиск от двух символов
                            this.banks.filtered = this.banks.all.filter(bank => bank.toLowerCase().includes(this.banks.filterWord.toLowerCase()))
                        } else {
                            this.banks.filtered = this.banks.all
                        }
                       }
                },
            }
        },
        methods: {

        },
        computed: {

        },
        watch: {

        },
        mounted: function() {
            this.banks.filtered = this.banks.all
        },
    }
</script>

<style lang="scss">

</style>